[{
  "id": "Indumarmol",
  "advertencia": "",
  "fecha": "2025-08-22",
  "desarrollo": "Front-end",
  "tecnologias1": "Angular, HTML, CSS, JavaScript",
  "titulo": "Sitio Web Corporativo y Catálogo - Indumármol",
  "subtitulo": "Desde 2019, Indumármol trabaja con dedicación para ofrecer piedras naturales y mármoles de la más alta calidad, que combinan belleza, resistencia y distinción. Por eso se planeo la estrategia de llegar a mas clientes por medio de una pagina web",
  "descripcionCorta": "Landing page, para el sector de pedrería decorativa (mármol, ónix, entre otros).",
  "descripcionLarga": "El proyecto se construyó como una Single-Page Application (SPA) utilizando Angular y TypeScript. La arquitectura se basa en componentes standalone para una mayor modularidad y un rendimiento optimizado. La navegación entre las distintas páginas (Inicio, Productos, Proyectos) se gestiona con Angular Router, permitiendo URLs limpias y una experiencia de usuario fluida. Los datos de productos y proyectos se cargan dinámicamente desde archivos JSON locales mediante un servicio y HttpClient. La maquetación es completamente responsive utilizando CSS Grid y Flexbox. La funcionalidad de los formularios de contacto y proveedores se integra directamente con los servicios de Netlify Forms a través de envíos AJAX (fetch), eliminando la necesidad de un backend propio.",
  "funcionalidades" : "Entre las características principales destaca el diseño de la plataforma permitiendo al usuario tener un flujo sencillo gracias a:",
  "funcion1": "Catálogo Dinámico",
  "funcion1_1": ": Las páginas de cada tipo de piedra (Mármol, Granito, etc.) y de cada proyecto se generan dinámicamente a partir de archivos JSON, permitiendo una fácil actualización del contenido sin tocar el código.",
  "funcion2": "Enrutamiento Avanzado",
  "funcion2_1":": Implementación del Angular Router para una navegación fluida entre páginas con URLs limpias (ej. /productos/marmol), mejorando la experiencia de usuario y el SEO.",
  "funcion3": "Formularios Funcionales con Netlify",
  "funcion3_1":": Integración de dos formularios distintos (Contacto y Proveedores) con el backend de Netlify Forms, incluyendo validación de tipo de archivo y envíos AJAX sin recarga de página. ",
  "funcion4": "Diseño Completamente Responsivo",
  "funcion4_1":": La maquetación se adapta a cualquier dispositivo, desde móviles hasta escritorios, utilizando técnicas modernas de CSS como Flexbox y Grid Layout para garantizar una visualización óptima.",
  "rol": "Desarrollador Front-end",
  "imagenPrincipal": "assets/img_proyectos/indumarmol_principal.jpg",
  "imagen1": "assets/img_proyectos/indumarmol_1.jpg",
  "imagen2": "assets/img_proyectos/indumarmol_2.jpg",
  "imagen3": "assets/img_proyectos/indumarmol_3.jpg",
  "tecnologias": ["Angular", "TypeScript", "HTML5", "CSS3", "Netlify", "Git", "Swiper.js"],
  "linkDemo": "https://indumarmolcol.com/",
  "linkRepo": null,
  "tectno1": "Angular",
  "tectno1_1": "Framework principal para construir una SPA moderna, modular y escalable con componentes standalone.",
  "tectno2": "TypeScript",
  "tectno2_1": "Lenguaje utilizado para asegurar un código robusto, tipado y más fácil de mantener a lo largo del proyecto.",
  "tectno3": "Angular Router",
  "tectno3_1": "Para gestionar la navegación compleja de la aplicación, incluyendo rutas dinámicas con parámetros (ej. /productos/:id).",
  "tectno4": "Netlify",
  "tectno4_1": "Plataforma de despliegue y backend para la gestión de formularios, permitiendo un flujo de trabajo basado en Git (CI/CD)."
},
  {
  "id": "Ortopedia",
  "advertencia": "",
  "fecha": "2025-08-25",
  "desarrollo": "Front-end",
  "tecnologias1": "Angular, HTML, CSS, JavaScript",
  "titulo": "Catálogo - Centro Técnico Ortopédico",
  "subtitulo": "El Centro Técnico Ortopédico, con una trayectoria desde 1996, busca mejorar la calidad de vida de sus pacientes a través de dispositivos personalizados. Para modernizar su alcance y presentar su catálogo de forma profesional, se desarrolló un sitio web enfocado en la usabilidad y la confianza del usuario.",
  "descripcionCorta": "Catálogo de productos para empresa especializada en soluciones ortopédicas.",
  "descripcionLarga": "El proyecto se desarrolló como una Single-Page Application (SPA) utilizando Angular, enfocado en la accesibilidad y el rendimiento. La arquitectura modular se basa en componentes standalone. La navegación, gestionada por Angular Router, permite un acceso fluido a secciones como 'Sobre Nosotros' y el catálogo, utilizando URLs limpias y parámetros de consulta (queryParams) para el filtrado. Los datos de los productos se cargan dinámicamente desde un archivo JSON local a través de un servicio, permitiendo una gestión de contenido sencilla. El diseño es completamente responsive, implementado con CSS Flexbox y Grid, y se integraron microinteracciones y animaciones sutiles (AOS.js) para mejorar la experiencia de usuario. El contacto directo se facilita a través de un botón flotante de WhatsApp.",
  "funcionalidades": "Entre las características principales destaca el diseño de la plataforma permitiendo al usuario tener un flujo sencillo gracias a:",
  "funcion1": "Catálogo Dinámico con Filtros",
  "funcion1_1": "El catálogo se alimenta de un archivo JSON, lo que facilita futuras actualizaciones. Incluye un sistema de filtros por categoría y parte del cuerpo que actualiza la URL y la vista en tiempo real, mejorando la usabilidad.",
  "funcion2": "Vista de Producto en Modal",
  "funcion2_1": "En lugar de navegar a una página separada, los detalles del producto se muestran en una ventana modal emergente. Esto mantiene al usuario en el contexto del catálogo, mejorando el flujo de la navegación y la experiencia general.",
  "funcion3": "Animaciones y Microinteracciones",
  "funcion3_1": "Se implementaron animaciones de entrada sutiles con la librería AOS.js para que las secciones aparezcan de forma elegante al hacer scroll. Las tarjetas de producto tienen efectos 'hover' que mejoran la interactividad.",
  "funcion4": "Navegación Pre-filtrada",
  "funcion4_1": "El menú de navegación principal incluye un desplegable que permite a los usuarios pre-filtrar el catálogo antes de navegar, llevándolos directamente a la categoría de su interés y actualizando la URL correspondientemente.",
  "rol": "Desarrollador Front-end",
  "imagenPrincipal": "assets/img_proyectos/ortopedia_principal.jpg",
  "imagen1": "assets/img_proyectos/ortopedia_1.jpg",
  "imagen2": "assets/img_proyectos/ortopedia_2.jpg",
  "imagen3": "assets/img_proyectos/ortopedia_3.jpg",
  "tecnologias": ["Angular", "TypeScript", "HTML5", "CSS3", "AOS.js", "Git"],
  "linkDemo": "https://ortopediacentro.netlify.app/",
  "linkRepo": "",
  "tectno1": "Angular",
  "tectno1_1": "Framework principal para construir una SPA moderna, modular y escalable con componentes standalone.",
  "tectno2": "TypeScript",
  "tectno2_1": "Lenguaje utilizado para asegurar un código robusto, tipado y más fácil de mantener a lo largo del proyecto.",
  "tectno3": "Angular Router",
  "tectno3_1": "Para gestionar la navegación y el estado de los filtros a través de la URL, usando parámetros de consulta (queryParams) para una experiencia de usuario compartible.",
  "tectno4": "AOS.js",
  "tectno4_1": "Librería ligera utilizada para implementar animaciones de entrada al hacer scroll, añadiendo un toque profesional y dinámico a la interfaz."
},
{
  "id": "GeneracionXXI",
  "advertencia": "Por políticas de la empresa, no se puede acceder directamente a la plataforma, ya que se usan datos personales",
  "fecha": "2022-12-20",
  "desarrollo": "Fullstack",
  "tecnologias1": "Python, HTML, CSS, FireBase",
  "titulo": "Control de Datos Personales",
  "subtitulo": "Claro Colombia se destaca como una de las principales empresas de telecomunicaciones, tras una campaña, los directivos deciden hacer un cambio de la formación de profesionales, a partir de alli se planeo la estrategia Generacion XXI, área de practicantes universitarios listos para trabajar, donde se parte para una plataforma web.",
  "descripcionCorta": "Plataforma Web para el control de datos personales generacion XXI, Claro Colombia.",
  "descripcionLarga": "El proyecto esta construido bajo librerias Python, entre ellas Flask, la comunicación con el backend es mediante tecnologias API, todo el serivicio frontend fue desarrollado con HTML, CSS y javascript. Para el enrutamiendo de bases de datos se implementó Firebase, servicios de analitica gracias a los servicios de Goolge Analitics",
  "funcionalidades" : "Entre las características principales destaca el diseño de la plataforma permitiendo al usuario tener un flujo sencillo gracias a:",
  "funcion1": "Autenticación",
  "funcion1_1": ": Sistema que permite al usuario crear una nueva cuenta o inciar sesión con una cuenta existente. La validación de usuario es mediante Firebase.",
  "funcion2": "Llamadas a la acción (CTA)",
  "funcion2_1":": Incluye múltiples llamadas a la acción (CTA) estratégicamente ubicadas para guiar a los usuarios hacia acciones específicas.",
  "funcion3": "Secciones Interactivas",
  "funcion3_1":": Incluye secciones interactivas, como carruseles de imágenes, servicios de busqueda y graficas animadas para proporcionar una experiencia envolvente. ",
  "funcion4": "Navegación Intuitiva",
  "funcion4_1":": Diseña una navegación clara y fácil de usar que permia a los usuarios encontrar rápidamente la información que están buscando y navegar sin problemas por el sitio.",
  "funcion5": "Analiticas",
  "funcion5_1":": Interfaz que permite al administrador tener un control mas personalizado sobre los datos de cada practicante, y sus funciones en la empresa",
  "funcion6": "Calificación",
  "funcion6_1": "Incluye la acción para la culminacion de la practica de cada practicante, donde el empleador califica al practicante para que la universidad pueda consultar el rendimiento, proyectos y calificación de este mismo.",
  "rol": "Desarrollador Fullstak",
  "imagenPrincipal": "assets/img_proyectos/geracionp.jpg",
  "imagen1": "assets/img_proyectos/genera1.jpg",
  "imagen2":  "assets/img_proyectos/genera2.jpg",
  "imagen3":  "assets/img_proyectos/genera3.jpg",
  "tecnologias": ["NextJS", "ReactJS", "SASS", "JavaScript", "HTML5", "API REST"],
  "linkDemo": "",
  "linkRepo": "https://github.com/tuUsuario/colraices-repo",

  "tectno1": "Python",
  "tectno1_1": "Se emplearon funcionalidades y optimización para mejorar el rendimiento y la visibilidad.",
  "tectno2": "Pandas",
  "tectno2_1": "Para la manipulación análisis de datos, facilitando la creación de deagramas para el administrador.",
  "tectno3": "Flask",
  "tectno3_1": "Se usó para los servicios indispensables web API.",
  "tectno4": "API",
  "tectno4_1": "Consumo de APIs de servicios externos para la visualización de contenido dinámico."
  }

]